app/controllers/reviews_controller.rb

  def create
    Review.create(review_params)
---
INSERT INTO `reviews` (`second_body`, `created_at`, `updated_at`, `thema_id`) VALUES ('usa', '2016-11-12 08:16:31', '2016-11-12 08:16:31', 33)