app/controllers/themas_controller.rb

SELECT COUNT(`reviews`.`thema_id`) AS count_thema_id, `reviews`.`thema_id` AS reviews_thema_id FROM `reviews` GROUP BY `reviews`.`thema_id` ORDER BY count_thema_id DESC
SELECT  `themas`.* FROM `themas` WHERE `themas`.`id` = 37 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`thema_id` = 33
SELECT `themas`.* FROM `themas`
---
  def index
    @thema = Thema.new
    thema_ids = Review.group(:thema_id).order('count_thema_id DESC').count(:thema_id).keys

    @ranking = thema_ids.map { |id| Thema.find(id)}
    @themas = Thema.all

SELECT  `themas`.* FROM `themas` WHERE (id < 35) ORDER BY @ranking_adga DESC LIMIT 1
SELECT COUNT(`reviews`.`thema_id`) AS count_thema_id, `reviews`.`thema_id` AS reviews_thema_id FROM `reviews` GROUP BY `reviews`.`thema_id` ORDER BY count_thema_id DESC
SELECT  `reviews`.* FROM `reviews` WHERE (id < 37) ORDER BY id DESC LIMIT 1
SELECT `themas`.* FROM `themas`
---
  def show
    @new_thema = Thema.new
    @thema = Thema.find(params[:id])
    @review = Review.new

    thema_ids = Review.group(:thema_id).order('count_thema_id DESC').count(:thema_id).keys

    @ranking = thema_ids.map { |id| Thema.find(id)}
    @themas = Thema.all