app/views/themas/show.html.haml

SELECT  `reviews`.* FROM `reviews` WHERE (id < 37) ORDER BY id DESC LIMIT 1
---
          からのご意見
          -@thema.reviews.each do|review|